sdaiValidateStringWidth(Sdai_instS*,Sdai_Id_aggr*)
\details
Validates whether all STRING-valued attributes of the specified application instance are of a valid width.
Retrieves the non-persistent list of attributes with invalid width, if found.
\param appInstance [in]  Identifier of the application instance to be validated.
\param list        [out] An identifier of a pre-existing NPL to which the SdaiAttr identifiers of
those attributes are appended that do not conform to the validation.
\returns
* sdaiTRUE if attributes with invalid width are not found.
* sdaiFALSE if such attributes are found.
* sdaiUNKNOWN if an error is encountered.